"""
Упражнение 29. Температура с учетом ветра
Когда в прохладный день еще и дует ветер, температура кажется более
низкой, чем есть на самом деле, поскольку движение воздушных масс
способствует более быстрому охлаждению теплых предметов, к коим
в данном случае можно отнести и человека. Этот эффект известен как
охлаждение ветром.
В 2001 году Канада, Великобритания и США договорились об исполь-
зовании общей формулы для определения коэффициента охлаждения
ветром. В формуле, приведенной ниже, Ta – это температура воздуха в гра-
дусах Цельсия, а V – скорость ветра в километрах в час. Похожие формулы
с другими константами могут использоваться для вычисления коэффици-
ента охлаждения ветром для температур, указанных в градусах по Фарен-
гейту, и скорости ветра в милях в час или метрах в секунду.
WCI = 13,12 + 0,6215Ta - 11,37V0,16 + 0,3965TaV0,16.
Напишите программу, которая будет запрашивать у пользователя тем-
пературу воздуха и скорость ветра и выдавать рассчитанный коэффици-
ент охлаждения ветром с округлением до ближайшего целого.
Примечание. Принято считать, что коэффициент охлаждения ветром допустимо рас-
считывать при температурах, меньших или равных 10 °С, и скорости ветра, превы-
шающей 4,8 км/ч.
"""

T = float(input('Введите темературу воздуха (°С): '))
V = float(input('Введите скорость ветра (км/ч): '))

WCI = round(13.12 + (0.6215 * T) + (-11.37 * (V ** 0.16)) + (0.3965 * T * (V ** 0.16)))

print('Коэффициент охлаждения ветром - ', WCI)
