"""
Тимофей обычно спит ночью XX часов
и устраивает себе днем тихий час на YY минут.
Определите, сколько всего минут Тимофей спит в сутки.
"""

sleep_night_hour = int(input())
sleep_day_min = int(input())
print(sleep_night_hour * 60 + sleep_day_min)
